/**********************************************************************************
// Player (Código Fonte)
//
// Criação:     01 Jan 2013
// Atualização: 04 Mar 2023
// Compilador:  Visual C++ 2022
//
// Descrição:   Player do jogo PacMan
//
**********************************************************************************/

#include "Arkology.h"
#include "Block5.h"


// ---------------------------------------------------------------------------------

Block5::Block5()
{
    // imagem da pedra é 126x122 (com borda transparente de 4 pixels)
    BBox(new Rect(-10, 07, 10, 150));
    MoveTo(480.0f, 450.0f);

    type = BLOCK5;
}

// ---------------------------------------------------------------------------------

Block5::~Block5()
{

}

void Block5::Update()
{
}

void Block5::Draw()
{
}

// ---------------------------------------------------------------------------------
