/**********************************************************************************
// Player (Código Fonte)
//
// Criação:     01 Jan 2013
// Atualização: 04 Mar 2023
// Compilador:  Visual C++ 2022
//
// Descrição:   Player do jogo PacMan
//
**********************************************************************************/

#include "Arkology.h"
#include "Block.h"


// ---------------------------------------------------------------------------------

Block::Block()
{
    // imagem da pedra é 126x122 (com borda transparente de 4 pixels)
    BBox(new Rect(-80, -18, 395, 10));
    MoveTo(480.0f, 450.0f);

    type = BLOCK;
}

// ---------------------------------------------------------------------------------

Block::~Block()
{

}

void Block::Update()
{
}

void Block::Draw()
{
}

// ---------------------------------------------------------------------------------
