/**********************************************************************************
// Player (Código Fonte)
//
// Criação:     01 Jan 2013
// Atualização: 04 Mar 2023
// Compilador:  Visual C++ 2022
//
// Descrição:   Player do jogo PacMan
//
**********************************************************************************/

#include "Arkology.h"
#include "Block8.h"


// ---------------------------------------------------------------------------------

Block8::Block8()
{
    // imagem da pedra é 126x122 (com borda transparente de 4 pixels)
    BBox(new Rect(-10, -10, 10, 285));
    MoveTo(480.0f, 450.0f);

    type = BLOCK8;
}

// ---------------------------------------------------------------------------------

Block8::~Block8()
{

}

void Block8::Update()
{
}

void Block8::Draw()
{
}

// ---------------------------------------------------------------------------------
